# debugging
- 스크립트 내 에러를 검출해 제거하는 과정. 
- 개발자 도구 안에 UI형태로 디버깅 툴 구현되어있음.

## Sources 패널
- 파일탐색영역: 페이지를 구성한 모든 파일을 트리형식으로 보여줌
- 코드 에디터영역: 파일탐색영역에서 선택한 파일의 소스코드를 보여줌 편집가능
- 자바스크립트 디버깅영역: 디버깅에 관련된 정보를 제공

## Console
ESC를 누르면 하단에 콘솔창 열림

## 중단점
코드 에디터 영역에서 번호를 클릭해 중단점 설정 가능
- 실행히 중지된 시점에 변수값 확인 가능 
- 디버깅영역에서 체크박스를 해제해 중단점 비활성화 가능, 마우스 우클릭으로 Remove breakpoint로 중단점 삭제가능
- 스크립트 내에 **debugger** 명령어로 중단점과 같은 설정 가능

## 디버깅영역
- Watch: 표현식을 평가하고 결과 보여줌. + 클릭 - 표현식 입력 - Enter: 중단 시점의 값을 보여줌
- Call Stack: 코드를 해당 중단점으로 안내한 실행 경로를 역순으로 표시. 중단점 설정한 시점이 최상단에 위치함.
- Scope: 현재 정의된 모든 변수를 출력

## 실행 추적하기 ( 디버깅영역 상단 버튼 왼->오 )
- Resume: 스크립트 실행을 다시 시작(단축키F8)
- Step: 다음 명령어를 실행(단축키F9) 스크립트를 문단위로 실행.
- Step over: 다음 명령어를 실행하되, 함수 안으로 들어가진 않음(단축키F10) 함수호출시 내부에서 일어나는 일이 궁금하지 않을때 유용
- Step info: 비동기 동작을 담당하는 코드로 진입, 필요하다면 비동기 동작이 완료될때까지 대기(단축키F10)
- Step out: 실행중인 함수의 실행이 끝날 때 까지 실행을 계속 함(단축키Shift+F11) 가능한 빨리 함수를 끝내고싶을때 유용.
- Deactivate breakpoints: 모든 중단점을 일시적으로 활성화/비활성화 
- Pause on exceptions: 예외발생시 코드를 자동 중지시켜주는 기능을 활성화/비활성화. 활성화되어있고 개발자도구가 열려있으면 스크립트 실행중 에러가 발생하면 자동으로 실행 멈춤.

## Console.log 
이 함수를 이용하면 원하는걸 콘솔에 출력 가능

## 스크립트 실행이 중단되는 경우
- 중단점을 만났을 때
- debugger문을 만났을 때
- 에러가 발생했을때(개발자도구가 열려있고 Pause on exceptions 버튼이 활성화 되어있는경우)
